AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТоварыНаСкладахПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТоварыНаСкладахПоставщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьНулевыеЗначения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидкиНаценки</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексСтрокиТаблицыЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/im_НоменклатураПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>im_НоменклатураПоставщиков</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.im_ПоставщикиИнтернетМагазина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.im_КатегорииПоставщиковИнтернетМагазина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПромоЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкционнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаАкции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияАкции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Изображениия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>URL</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ОбменССайтом/Ext/Module.bsl
// t.me/konstantyn_buhantsev [16 грудня 2024 р.] --> 

Функция ВыгрузитьИзображениеНаСайт(УзелОбмена, ПрисоединенныйФайл) Экспорт
	
	Если ТипЗнч(ПрисоединенныйФайл.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда 
		Картинка = ПрисоединенныйФайл.Хранилище.Получить();
		Попытка
			Расширение = НРег(Строка(Картинка.Формат()));
			Если Расширение="" Тогда 
				Расширение = "webp";
			КонецЕсли;
		Исключение
			//МассивИмени = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПрисоединенныйФайл.ИмяФайла, ".");
			//Если МассивИмени.Количество() Тогда
			//    Расширение = МассивИмени[МассивИмени.Количество() - 1];
			//Иначе		
			//	ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьИзображениеНаСайт", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось получить расширение файла!");
			//	Возврат Ложь; 
			//КонецЕсли;
			Расширение = "webp";
		КонецПопытки;
		
		HTTPСоединение = Новый HTTPСоединение(УзелОбмена.URL,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
		ВремГраница = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
		ТелоЗапроса = Новый ТекстовыйДокумент();
		ТелоЗапроса.РазделительСтрок = Символы.CR + Символы.LF;
		
		ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
		ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""guid"";");
		ТелоЗапроса.ДобавитьСтроку("");
		ТелоЗапроса.ДобавитьСтроку(Строка(ПрисоединенныйФайл.Объект.УникальныйИдентификатор()));
		
		ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
		ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""token"";");
		ТелоЗапроса.ДобавитьСтроку("");
		ТелоЗапроса.ДобавитьСтроку(УзелОбмена.Токен);
		
		ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
		ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""type"";");
		ТелоЗапроса.ДобавитьСтроку("");
		ТелоЗапроса.ДобавитьСтроку(?(ПрисоединенныйФайл.Объект.ОсновноеИзображение = ПрисоединенныйФайл.Ссылка, "primary", "secondary"));
		
		ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
		ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""image_url"";");
		ТелоЗапроса.ДобавитьСтроку("");
		Если НЕ ПрисоединенныйФайл.ПометкаУдаления Тогда
			ТелоЗапроса.ДобавитьСтроку(УзелОбмена.URLКартинки 
										+ Строка(ПрисоединенныйФайл.Ссылка.УникальныйИдентификатор()) 
										+ "."
										+ Расширение);
		Иначе
			ТелоЗапроса.ДобавитьСтроку("");								
		КонецЕсли; 
		
		ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
		ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""1c_id"";");
		ТелоЗапроса.ДобавитьСтроку("");
		ТелоЗапроса.ДобавитьСтроку(Строка(ПрисоединенныйФайл.Ссылка.УникальныйИдентификатор()));							
		
		ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница + "--");
		
		ТелоЗапросаСтрока = ТелоЗапроса.ПолучитьТекст();
		
		HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/upload_image");
		HTTPЗапрос.Заголовки["Content-Type"] = "multipart/form-data; boundary=" + ВремГраница;
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		Попытка
			HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьИзображениеНаСайт", УровеньЖурналаРегистрации.Ошибка, ,ПрисоединенныйФайл , ТекстОшибки);
			Возврат Ложь;
		КонецПопытки;
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьИзображениеНаСайт", УровеньЖурналаРегистрации.Ошибка, , ПрисоединенныйФайл, "Ошибка сервера " + Строка(HTTPОтвет.КодСостояния) + " " + HTTPОтвет.ПолучитьТелоКакСтроку());
			Возврат Ложь;
		КонецЕсли; 
		
		JSON = Новый ЧтениеJSON;
		JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
		
		Попытка
			РезультатСоответствие = ПрочитатьJSON(JSON, Истина);
			Если РезультатСоответствие.Получить("error") <> Неопределено Тогда
				ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьИзображениеНаСайт", УровеньЖурналаРегистрации.Ошибка, ,ПрисоединенныйФайл , РезультатСоответствие.Получить("error"));
				Возврат Ложь;
			КонецЕсли;
			Возврат Истина;
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьИзображениеНаСайт", УровеньЖурналаРегистрации.Ошибка, ,ПрисоединенныйФайл, ТекстОшибки);
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ВыгрузитьЦенуДляСайта(УзелОбмена, СтруктураЦены) Экспорт
	
	HTTPСоединение = Новый HTTPСоединение(УзелОбмена.URL,,,,,,Новый ЗащищенноеСоединениеOpenSSL);

	ВремГраница = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ТелоЗапроса = Новый ТекстовыйДокумент();
	ТелоЗапроса.РазделительСтрок = Символы.CR + Символы.LF;
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""guid"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Строка(СтруктураЦены.Номенклатура.УникальныйИдентификатор()));

	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""token"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(УзелОбмена.Токен);
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""amount"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Формат(СтруктураЦены.Цена, "ЧДЦ=2; ЧРД=.; ЧГ=0"));
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""date_start"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Формат(СтруктураЦены.ДатаНачалаАкции, "ДФ=yyyy-MM-dd"));
		
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""date_end"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Формат(СтруктураЦены.ДатаОкончанияАкции, "ДФ=yyyy-MM-dd"));
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница + "--");

	ТелоЗапросаСтрока = ТелоЗапроса.ПолучитьТекст();
	
	HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/add_special");
	HTTPЗапрос.Заголовки["Content-Type"] = "multipart/form-data; boundary=" + ВремГраница;
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦенуДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦенуДляСайта", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка сервера " + Строка(HTTPОтвет.КодСостояния) + " " + HTTPОтвет.ПолучитьТелоКакСтроку());
		Возврат Ложь;
	КонецЕсли; 
	
	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	
	Попытка
		РезультатСоответствие = ПрочитатьJSON(JSON, Истина);
		Если РезультатСоответствие.Получить("error") <> Неопределено Тогда
			ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦенуДляСайта", УровеньЖурналаРегистрации.Ошибка, , , РезультатСоответствие.Получить("error"));
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦенуДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьURLКартинкиТовара(УзелОбмена, Номенклатура) Экспорт

	HTTPСоединение = Новый HTTPСоединение(УзелОбмена.URL,,,,,,Новый ЗащищенноеСоединениеOpenSSL);		
	
	ГУИД = Строка(Номенклатура.УникальныйИдентификатор());
	HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/upload_image/get_images&uid=" + ГУИД);
	
	Попытка
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ПолучитьURLКартинкиТовара", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("ОбменССайтом.ПолучитьURLКартинкиТовара", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка сервера " + Строка(HTTPОтвет.КодСостояния) + " " + HTTPОтвет.ПолучитьТелоКакСтроку());
		Возврат Неопределено;
	КонецЕсли; 
	
	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	
	Попытка
		РезультатСоответствие = ПрочитатьJSON(JSON, Истина);
		Если РезультатСоответствие.Получить("error") <> Неопределено Тогда
			ЗаписьЖурналаРегистрации("ОбменССайтом.ПолучитьURLКартинкиТовара", УровеньЖурналаРегистрации.Ошибка, , , РезультатСоответствие.Получить("error"));
			Возврат Неопределено;
		КонецЕсли;
		Возврат РезультатСоответствие.Получить(ГУИД);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ПолучитьURLКартинкиТовара", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции // ()
 
Функция ВыгрузитьБрендНоменклатуы(УзелОбмена, Номенклатура) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура.Бренд) Тогда
		Возврат Ложь;	
	КонецЕсли; 
	
	HTTPСоединение = Новый HTTPСоединение(УзелОбмена.URL,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
	ВремГраница = СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	ТелоЗапроса = Новый ТекстовыйДокумент();
	ТелоЗапроса.РазделительСтрок = Символы.CR + Символы.LF;
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""guid"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Строка(Номенклатура.УникальныйИдентификатор()));

	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""token"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(УзелОбмена.Токен);
	
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница);
	ТелоЗапроса.ДобавитьСтроку("Content-Disposition: form-data; name=""name"";");
	ТелоЗапроса.ДобавитьСтроку("");
	ТелоЗапроса.ДобавитьСтроку(Строка(Номенклатура.Бренд));
		
	ТелоЗапроса.ДобавитьСтроку("--" + ВремГраница + "--");

	ТелоЗапросаСтрока = ТелоЗапроса.ПолучитьТекст();
	
	HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/manufacturers/addToProduct");
	HTTPЗапрос.Заголовки["Content-Type"] = "multipart/form-data; boundary=" + ВремГраница;
	HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьБрендНоменклатуы", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьБрендНоменклатуы", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка сервера " + Строка(HTTPОтвет.КодСостояния) + " " + HTTPОтвет.ПолучитьТелоКакСтроку());
		Возврат Ложь;
	КонецЕсли; 
	
	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	
	Попытка
		РезультатСоответствие = ПрочитатьJSON(JSON, Истина);
		Если РезультатСоответствие.Получить("error") <> Неопределено Тогда
			ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьБрендНоменклатуы", УровеньЖурналаРегистрации.Ошибка, , , РезультатСоответствие.Получить("error"));
			Возврат Ложь;
		КонецЕсли;
		Возврат Истина;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьБрендНоменклатуы", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;

КонецФункции // ()

Функция ВыгрузитьОстаткиТоваровДляСайта(УзелОбмена = Неопределено) Экспорт
	
	Если УзелОбмена = Неопределено Тогда
		УзелОбмена = Константы.УзелОбменаССайтом.Получить();	
	КонецЕсли; 
	
	HTTPСоединение = Новый HTTPСоединение(УзелОбмена.URL,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	ТаблицаДанных = ПолучитьТаблицуОстатков();
	СтруктураДанных = Новый Структура("token, quantities");
	
	СтруктураДанных.token = УзелОбмена.Токен;
	
	МассивДанных = Новый Массив;
	Для каждого СтрТабл Из ТаблицаДанных Цикл
		
		Данные = Новый Структура("guid, quantity");	
		Данные.guid = Строка(СтрТабл.Номенклатура.УникальныйИдентификатор());
		Данные.quantity = СтрТабл.КоличествоОстаток;
		
		МассивДанных.Добавить(Данные);
	КонецЦикла; 
	
	СтруктураДанных.quantities = МассивДанных;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	
	HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/price/changeQuantities");
	HTTPЗапрос.Заголовки["Content-Type"] = "application/json";
	HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьОстаткиТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьОстаткиТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка сервера " + Строка(HTTPОтвет.КодСостояния) + " " + HTTPОтвет.ПолучитьТелоКакСтроку());
		Возврат Ложь;
	КонецЕсли; 
	
	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	
	Попытка
		РезультатСоответствие = ПрочитатьJSON(JSON, Истина);
		Для каждого КлючЗначение Из РезультатСоответствие Цикл
			Если ТипЗнч(КлючЗначение.Значение) = Тип("Строка") Тогда
				Сообщение = Строка(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Ключ)))
							+ " " + КлючЗначение.Значение; 
				Сообщить(Сообщение);
				ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьОстаткиТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
			КонецЕсли;			
		КонецЦикла;
		Возврат Истина;
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьОстаткиТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;

КонецФункции // ()

Функция ВыгрузитьЦеныТоваровДляСайта(УзелОбмена = Неопределено, УстановкаЦен) Экспорт
	
	Если УзелОбмена = Неопределено Тогда
		УзелОбмена = Константы.УзелОбменаССайтом.Получить();	
	КонецЕсли; 
	
	HTTPСоединение = Новый HTTPСоединение(УзелОбмена.URL,,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	СтруктураДанных = Новый Структура("token, prices");
	СтруктураДанных.token = УзелОбмена.Токен;
	
	//СтруктураОтбора = Новый Структура("ТипЦен", Константы.ТипЦенИнтернетМагазина.Получить());
	//НайденныеСтроки = УстановкаЦен.Товары.НайтиСтроки(СтруктураОтбора);
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УстановкаЦенНоменклатурыТовары.Номенклатура,
	               |	УстановкаЦенНоменклатурыТовары.Цена
	               |ИЗ
	               |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	               |ГДЕ
	               |	УстановкаЦенНоменклатурыТовары.ТипЦен = &ТипЦен
	               |	И УстановкаЦенНоменклатурыТовары.Номенклатура В ИЕРАРХИИ(&ГруппаНоменклатураИМ)
	               |	И УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",УстановкаЦен);
	Запрос.УстановитьПараметр("ТипЦен",Константы.ТипЦенИнтернетМагазина.Получить());
	Запрос.УстановитьПараметр("ГруппаНоменклатураИМ",Константы.КатологТоваровИнтернетМагазина.Получить());
	НайденныеСтроки = Запрос.Выполнить().Выгрузить();
	
	
	Если НЕ НайденныеСтроки.Количество() Тогда
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"В документе цен " + УстановкаЦен.Номер + " не найдены цены по типу Интернет Магазина!");
		Возврат Истина;	
	КонецЕсли;	
		
	МассивДанных = Новый Массив;
	Для каждого СтрТабл Из НайденныеСтроки Цикл
		
		Данные = Новый Структура("guid, price");	
		Данные.guid = Строка(СтрТабл.Номенклатура.УникальныйИдентификатор());
		Данные.price = СтрТабл.Цена;
		Если СтрТабл.Цена<> 0 Тогда 
			МассивДанных.Добавить(Данные);
		КонецЕсли;
	КонецЦикла; 
	
	СтруктураДанных.prices = МассивДанных;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
	СтрокаJson = ЗаписьJSON.Закрыть();
	
	
	//Текст = Новый ЗаписьТекста;
	//            Текст.Открыть("C:\1C_Xatanet_Ch\1.txt",КодировкаТекста.ANSI);
	//            Текст.ЗаписатьСтроку(СтрокаJson);
	//            Текст.Закрыть();
	
	HTTPЗапрос = Новый HTTPЗапрос("index.php?route=api/price/changePrices");
	HTTPЗапрос.Заголовки["Content-Type"] = "application/json";
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJson, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка сервера " + Строка(HTTPОтвет.КодСостояния) + " " + HTTPОтвет.ПолучитьТелоКакСтроку());
		Возврат Ложь;
	КонецЕсли; 
	
	JSON = Новый ЧтениеJSON;
	JSON.УстановитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку());
	
	Попытка
		Результат = ПрочитатьJSON(JSON, Истина);
		
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			
			Для каждого РезультатСоответвсвие из Результат Цикл
				Для каждого КлючЗначение Из РезультатСоответвсвие Цикл
					Если НЕ КлючЗначение.Ключ = "success" Тогда
						Сообщение = Строка(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Ключ)))
									+ " " + КлючЗначение.Значение; 
						Сообщить(Сообщение);
						ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
						Возврат Ложь;	
					КонецЕсли;	
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Результат) = Тип("Соответствие") Тогда
			
			Для каждого КлючЗначениеРезультат Из Результат Цикл
				ЗначениеРезультат = КлючЗначениеРезультат.Значение;
				Если ТипЗнч(ЗначениеРезультат) = Тип("Строка") Тогда
					ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ЗначениеРезультат);
					Возврат Ложь;
				КонецЕсли; 
				Для каждого КлючЗначение Из ЗначениеРезультат Цикл
					Если НЕ КлючЗначение.Ключ = "success" Тогда
						Сообщение = Строка(Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(КлючЗначение.Ключ)))
									+ " " + КлючЗначение.Значение; 
						Сообщить(Сообщение);
						ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
						Возврат Ложь;	
					КонецЕсли;
				КонецЦикла; 
			КонецЦикла; 
			
		Иначе
			
			ТекстОшибки = "Пришел ответ неизвестного формата...";
			ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
			Возврат Ложь;
			
		КонецЕсли;	
		
		Возврат Истина;
		
	Исключение
		
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ОбменССайтом.ВыгрузитьЦеныТоваровДляСайта", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		Возврат Ложь;
		
	КонецПопытки;

КонецФункции // ()

Функция ПолучитьТаблицуОстатков()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВложенныйЗапрос.Номенклатура.НеПоказыватьНаСайте
	               |				ТОГДА 0
	               |			ИНАЧЕ ВложенныйЗапрос.КоличествоОстаток
	               |		КОНЕЦ) КАК КоличествоОстаток
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ОстатокИРезерв.Номенклатура КАК Номенклатура,
	               |		ОстатокИРезерв.КоличествоОстаток КАК КоличествоОстаток
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |			СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	               |		ИЗ
	               |			РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |					,
	               |					Номенклатура В ИЕРАРХИИ (&ГруппаНоменклатуры)
	               |						И Склад.ВыгружатьНаСайт = ИСТИНА) КАК ТоварыНаСкладахОстатки
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	               |						,
	               |						Номенклатура В ИЕРАРХИИ (&ГруппаНоменклатуры)
	               |							И Склад.ВыгружатьНаСайт = ИСТИНА) КАК ТоварыВРезервеНаСкладахОстатки
	               |				ПО ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
	               |					И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТоварыНаСкладахОстатки.Номенклатура) КАК ОстатокИРезерв
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		Номенклатура.Ссылка,
	               |		0
	               |	ИЗ
	               |		Справочник.Номенклатура КАК Номенклатура
	               |	ГДЕ
	               |		Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаНоменклатуры)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		im_НоменклатураПоставщиков.Номенклатура,
	               |		im_НоменклатураПоставщиков.Количество
	               |	ИЗ
	               |		Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
	               |	ГДЕ
	               |		НЕ im_НоменклатураПоставщиков.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.пустаяссылка)
	               |		И im_НоменклатураПоставщиков.Поставщик <> &Поставщик_DCLink) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	НЕ ВложенныйЗапрос.Номенклатура.ПометкаУдаления
	               |	И НЕ ВложенныйЗапрос.Номенклатура.ЭтоГруппа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	КоличествоОстаток";
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", Константы.КатологТоваровИнтернетМагазина.Получить());
	Запрос.УстановитьПараметр("Поставщик_DCLink", Справочники.im_ПоставщикиИнтернетМагазина.DCLINK);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;

КонецФункции // ()
 
Функция ПолучитьОстаткиТоваровИПоставщиков(УзелОбмена = Неопределено) Экспорт

	Если УзелОбмена = Неопределено Тогда
		УзелОбмена = Константы.УзелОбменаССайтом.Получить();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Склад КАК Склад,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВложенныйЗапрос.Номенклатура.НеПоказыватьНаСайте
	               |				ТОГДА 0
	               |			ИНАЧЕ ЕСТЬNULL(ВложенныйЗапрос.КоличествоОстаток, 0)
	               |		КОНЕЦ) КАК КоличествоОстаток,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВложенныйЗапрос.Номенклатура.НеПоказыватьНаСайте
	               |				ТОГДА 0
	               |			ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахПоставщиковСрезПоследних.Количество, 0)
	               |		КОНЕЦ) КАК КоличествоПоставщиков
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТоварыНаСкладахОстатки.Склад КАК Склад,
	               |		ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |		ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |	ИЗ
	               |		РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |				,
	               |				Номенклатура В ИЕРАРХИИ (&ГруппаНоменклатуры)
	               |					И ВЫБОР
	               |						КОГДА &ЕстьОтборПоСкладам
	               |							ТОГДА Склад В (&МассивСкладов)
	               |						ИНАЧЕ ИСТИНА
	               |					КОНЕЦ) КАК ТоварыНаСкладахОстатки
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ТоварыВРезервеНаСкладахОстатки.Склад,
	               |		ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	               |		-1 * ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток
	               |	ИЗ
	               |		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	               |				,
	               |				Номенклатура В ИЕРАРХИИ (&ГруппаНоменклатуры)
	               |					И НЕ Номенклатура.НеПоказыватьНаСайте
	               |					И ВЫБОР
	               |						КОГДА &ЕстьОтборПоСкладам
	               |							ТОГДА Склад В (&МассивСкладов)
	               |						ИНАЧЕ ИСТИНА
	               |					КОНЕЦ) КАК ТоварыВРезервеНаСкладахОстатки) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыНаСкладахПоставщиков.СрезПоследних КАК ТоварыНаСкладахПоставщиковСрезПоследних
	               |		ПО ВложенныйЗапрос.Номенклатура = ТоварыНаСкладахПоставщиковСрезПоследних.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.Склад
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Склад
	               |ИТОГИ
	               |	СУММА(КоличествоОстаток),
	               |	СРЕДНЕЕ(КоличествоПоставщиков)
	               |ПО
	               |	Номенклатура";
	Если ЗначениеЗаполнено(УзелОбмена.ГруппаДляВыгрузкиОстатков) Тогда
		Запрос.УстановитьПараметр("ГруппаНоменклатуры", УзелОбмена.ГруппаДляВыгрузкиОстатков);
	Иначе
		Запрос.УстановитьПараметр("ГруппаНоменклатуры", Константы.КатологТоваровИнтернетМагазина.Получить());
	КонецЕсли; 
	
	Если УзелОбмена.СкладыОстатков.Количество() Тогда
		Запрос.УстановитьПараметр("ЕстьОтборПоСкладам", Истина);
		Запрос.УстановитьПараметр("МассивСкладов", УзелОбмена.СкладыОстатков.ВыгрузитьКолонку("Склад"));
	Иначе
		Запрос.УстановитьПараметр("ЕстьОтборПоСкладам", Ложь);		
	КонецЕсли; 
	
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураДанных = Новый Структура("data, timestamp");
	СтруктураДанных.timestamp = Формат(ТекущаяДата(), "ДФ=yyyy-MM-ddThh:mm:ssZ");
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		СтруктураНоменклатуры = Новый Структура("guid, item_name, unit, warehouses, total_quantity, supplier_avability");
		СтруктураНоменклатуры.guid = Строка(ВыборкаНоменклатуры.Номенклатура.УникальныйИдентификатор());
		СтруктураНоменклатуры.item_name = Строка(ВыборкаНоменклатуры.Номенклатура);
		СтруктураНоменклатуры.unit = Строка(ВыборкаНоменклатуры.Номенклатура.БазоваяЕдиницаИзмерения);
		СтруктураНоменклатуры.total_quantity = ВыборкаНоменклатуры.КоличествоОстаток; 
		СтруктураНоменклатуры.supplier_avability = ?(ВыборкаНоменклатуры.КоличествоПоставщиков > 0, Истина, Ложь);
		
		ВыборкаПоСкладам = ВыборкаНоменклатуры.Выбрать();
		
		МассивПоСкладам = Новый Массив;
		Пока ВыборкаПоСкладам.Следующий() Цикл
			
			СтруктураПоСкладу = Новый Структура("warehouse_id, warehouse_name, quantity");
			СтруктураПоСкладу.warehouse_id = Строка(ВыборкаПоСкладам.Склад.УникальныйИдентификатор()); 
			СтруктураПоСкладу.warehouse_name = Строка(ВыборкаПоСкладам.Склад);
			СтруктураПоСкладу.quantity = ВыборкаПоСкладам.КоличествоОстаток;
			
			МассивПоСкладам.Добавить(СтруктураПоСкладу);			
		
		КонецЦикла; 
		
		СтруктураНоменклатуры.warehouses = МассивПоСкладам;
		
		МассивДанных.Добавить(СтруктураНоменклатуры);
		
	КонецЦикла; 
	
	СтруктураДанных.data = МассивДанных;
	
	Возврат СтруктураДанных;

КонецФункции // ()
 
Процедура ЗарегистрироватьИзмененияСправочникаДляОбменаССайтом(Источник, Отказ) Экспорт
	
	УзелОбмена = Константы.УзелОбменаССайтом.Получить();
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ХранилищеДополнительнойИнформации") Тогда
		
		Если НЕ ТипЗнч(Источник.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
			Возврат;	
		КонецЕсли; 
		
		Номенклатура = Источник.Объект;
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Источник.Ссылка);	
	
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникОбъект.Номенклатура") Тогда
		
		Номенклатура = Источник.Ссылка;
		Если Номенклатура.ЭтоГруппа 
			ИЛИ Номенклатура.ПометкаУдаления Тогда
			Возврат;		
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Номенклатура.Бренд) Тогда
		
			//Если НоменклатураВГруппеТоваровИМ(Номенклатура) Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Номенклатура);					
			//КонецЕсли; 	
		
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗарегистрироватьИзмененияДокументаДляОбменаССайтом(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	УзелОбмена = Константы.УзелОбменаССайтом.Получить();
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.УстановкаЦенНоменклатуры") Тогда
		
		ТипЦенИнтернетМагазинАкция = Константы.ТипЦенАкцияИМ.Получить();
		Если ЗначениеЗаполнено(ТипЦенИнтернетМагазинАкция) Тогда
		 	СтруктураОтбора = Новый Структура("ТипЦен", ТипЦенИнтернетМагазинАкция);
			НайденныеСтроки = Источник.ТипыЦен.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() Тогда
		    	ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Источник.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
		ТипЦенИнтернетМагазин = Константы.ТипЦенИнтернетМагазина.Получить();
		Если ЗначениеЗаполнено(ТипЦенИнтернетМагазин) Тогда
			СтруктураОтбора = Новый Структура("ТипЦен", ТипЦенИнтернетМагазин);
			НайденныеСтроки = Источник.ТипыЦен.НайтиСтроки(СтруктураОтбора);
			Если НайденныеСтроки.Количество() Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, Источник.Ссылка);	
			КонецЕсли;
		КонецЕсли;
			
	КонецЕсли; 
	
КонецПроцедуры

Функция НоменклатураВГруппеТоваровИМ(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ(&Группа)
	               |	И НЕ Номенклатура.ЭтоГруппа
	               |	И НЕ Номенклатура.ПометкаУдаления";
	Запрос.УстановитьПараметр("Группа", Константы.КатологТоваровИнтернетМагазина.Получить());
	Результат = Запрос.Выполнить().Выгрузить();
	МассивТоваровИМ = Результат.ВыгрузитьКолонку("Номенклатура");
	
	Если НЕ МассивТоваровИМ.Найти(Номенклатура) = Неопределено Тогда
		Возврат Истина;		
	КонецЕсли;	
	
	Возврат Ложь;

КонецФункции // ()
 
Функция ВыгрузитьУстановкуЦен(УзелОбмена, УстановкаЦен) Экспорт

	ТипыЦен = УстановкаЦен.ТипыЦен;		
		
	ТипЦенИнтернетМагазинАкция = Константы.ТипЦенАкцияИМ.Получить();
	Если НЕ ЗначениеЗаполнено(ТипЦенИнтернетМагазинАкция) Тогда
		ЗаписьЖурналаРегистрации(
					"ОбменССайтом.ВыгрузитьУстановкуЦен",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Документы.УстановкаЦенНоменклатуры,
					УстановкаЦен,
					"Не установлена константа ТипЦенАкцияИМ");
		Возврат Ложь;	
	КонецЕсли;	
		
	ТипЦенИнтернетМагазин = Константы.ТипЦенИнтернетМагазина.Получить();
	Если НЕ ЗначениеЗаполнено(ТипЦенИнтернетМагазин) Тогда	
		ЗаписьЖурналаРегистрации(
					"ОбменССайтом.ВыгрузитьУстановкуЦен",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Документы.УстановкаЦенНоменклатуры,
					УстановкаЦен,
					"Не установлена константа ТипЦенИнтернетМагазина");
		Возврат Ложь;	
	КонецЕсли;
	
	ЕстьОшибка = Ложь;
	
	СтруктураОтбора = Новый Структура("ТипЦен", ТипЦенИнтернетМагазинАкция);
	НайденныеСтроки = ТипыЦен.НайтиСтроки(СтруктураОтбора);
	Если НайденныеСтроки.Количество() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	УстановкаЦенНоменклатурыТовары.Номенклатура,
		               |	УстановкаЦенНоменклатурыТовары.Цена,
		               |	im_НоменклатураПоставщиков.Ссылка КАК НоменклатураПоставщиков,
		               |	im_НоменклатураПоставщиков.АкционнаяЦена,
		               |	im_НоменклатураПоставщиков.ДатаНачалаАкции,
		               |	im_НоменклатураПоставщиков.ДатаОкончанияАкции
		               |ИЗ
		               |	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.im_НоменклатураПоставщиков КАК im_НоменклатураПоставщиков
		               |		ПО УстановкаЦенНоменклатурыТовары.Номенклатура = im_НоменклатураПоставщиков.Номенклатура
		               |ГДЕ
		               |	УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
		               |	И УстановкаЦенНоменклатурыТовары.ТипЦен = &ТипЦен
		               |	И УстановкаЦенНоменклатурыТовары.Номенклатура В ИЕРАРХИИ(&ГруппаИнтернеМагазина)";
		Запрос.УстановитьПараметр("ГруппаИнтернеМагазина",Константы.КатологТоваровИнтернетМагазина.Получить());
		Запрос.УстановитьПараметр("Ссылка", УстановкаЦен);
		Запрос.УстановитьПараметр("ТипЦен", ТипЦенИнтернетМагазинАкция);
		Результат = Запрос.Выполнить().Выгрузить();
		Для каждого СтрТабл Из Результат Цикл
			
			Если СтрТабл.Цена = 0 Тогда
				Продолжить;						
			КонецЕсли; 
			
			Выгружена = ВыгрузитьЦенуДляСайта(
				УзелОбмена,
				Новый Структура("Номенклатура, Цена, ДатаНачалаАкции, ДатаОкончанияАкции",
					СтрТабл.Номенклатура, СтрТабл.Цена, СтрТабл.ДатаНачалаАкции, СтрТабл.ДатаОкончанияАкции));	
			Если НЕ Выгружена Тогда
				ЗаписьЖурналаРегистрации(
					"ОбменССайтом.ВыгрузитьУстановкуЦен",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Документы.УстановкаЦенНоменклатуры,
					УстановкаЦен,
					"Не удалось выгрузить цену номенклатуры " + СтрТабл.Номенклатура + " на сайт!");
				ЕстьОшибка = Истина;
			КонецЕсли;
			
		КонецЦикла; 
	
	КонецЕсли;
				
	СтруктураОтбора = Новый Структура("ТипЦен", ТипЦенИнтернетМагазин);
	НайденныеСтроки = ТипыЦен.НайтиСтроки(СтруктураОтбора);
	Если НайденныеСтроки.Количество() Тогда
		
		Выгружены = ВыгрузитьЦеныТоваровДляСайта(
				УзелОбмена,
				УстановкаЦен);	
		Если НЕ Выгружены Тогда
			ЗаписьЖурналаРегистрации(
				"ОбменССайтом.ВыгрузитьУстановкуЦен",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.УстановкаЦенНоменклатуры,
				УстановкаЦен,
				"Не удалось выгрузить цены номенклатуры на сайт!");
			ЕстьОшибка = Истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат НЕ ЕстьОшибка;

КонецФункции // ()
